{
  "backend/main.mo": "Motoko actor implementing job posting submission and fraud analysis with email domain verification, company lookup against a hardcoded database, and fraud detection based on salary, description length, and urgency keywords.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing a React app with colorful gradient UI, job submission/analysis workflow, React Query hooks, and Tailwind configuration with vibrant OKLCH color system.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with variables for background, foreground, primary, secondary, destructive, and chart colors.",
  "frontend/index.html": "HTML entry point with comprehensive SEO meta tags, Open Graph and Twitter card metadata for job fraud detection application, and script tag loading React app from main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring QueryClient with 5-minute stale time, managing job submission state, and rendering JobPostInput or AnalysisResults based on submission status with ThemeProvider and Toaster.",
  "frontend/src/components/AnalysisLayout.tsx": "Layout wrapper component with animated gradient header featuring Shield icon and app title, main content area, and footer with caffeine.ai attribution link and animated heart icon.",
  "frontend/src/components/AnalysisResults.tsx": "Results display component showing fraud analysis with color-coded cards (red for fraudulent, green for safe), confidence score, fraud indicators list, email domain verification, and company info with loading/error states.",
  "frontend/src/components/CompanyInfoDisplay.tsx": "Company information card component displaying company name, industry, verification status with badge, star rating for verified companies, and contextual messages about verification status with gradient styling.",
  "frontend/src/components/JobPostInput.tsx": "React component that renders a form for submitting job postings with fields for title, description, company name, contact email, salary, and optional image upload. Uses the useJobSubmission hook to submit data and displays validation errors and success messages via toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and AuthClient lifecycle. Exports InternetIdentityProvider component and useInternetIdentity hook for accessing authentication state throughout the app.",
  "frontend/src/hooks/useJobAnalysis.ts": "Simple wrapper hook around useAnalyzeJobPosting that returns job analysis data, loading state, and error for a given job ID.",
  "frontend/src/hooks/useJobSubmission.ts": "Custom hook that handles job posting submission to the backend actor, managing submission state and errors. Accepts job data including title, description, company name, contact email, and optional salary, returning the created job ID.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for data fetching, specifically useAnalyzeJobPosting which fetches job analysis results from the backend actor for a given job ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining a vibrant color palette including primary, secondary, accent, success, warning colors. Includes custom gradient utilities and animations for visual effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication, then renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH colors, border radius variables, box shadows with glow effects, and custom animations including gradient shifts and pulse effects.",
  "project_state.json": "Project state tracking file for a job post analyzer application that detects suspicious job postings using NLP and ML, built with Motoko backend and React TypeScript frontend. Contains architectural notes, existing features for input interface, company lookup, classification system, and recent UI enhancements with vibrant colorful styling."
}